jwt_auth/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

jwt_auth/src/CommonModules/АдаптерКонтакты/Module.bsl
Функция АктивныеКонтактыБезТекущегоПользователя(Знач ВходОперации, Знач ИдентификаторПользователя, Знач РезолверКонтактов) Экспорт
	
	КонтактыСырые = Справочники.Пользователи.АктивныеПользователиПоФильтру(ИдентификаторПользователя, ВходОперации.Лимит, ВходОперации.Порядок, ВходОперации.Сортировка);
	
	Контакты = Новый Массив;
	
	Для Каждого Стр Из КонтактыСырые Цикл
		Идентификатор = РезолверКонтактов.UUIDПоСсылке(Стр.Пользователь);
		Контакт = Новый Структура("Идентификатор, Наименование, Недействителен, Служебный, ПометкаУдаления");
		Контакт.Вставить("Идентификатор", Идентификатор);
		Контакт.Вставить("Наименование", Стр.Наименование);
		Контакт.Вставить("Недействителен", Стр.Недействителен);
		Контакт.Вставить("Служебный", Стр.Служебный);
		Контакт.Вставить("ПометкаУдаления", Стр.ПометкаУдаления);
		
		Контакты.Добавить(Контакт);
	КонецЦикла;
	
	Возврат Контакты;
	
КонецФункции
